animal = ["крыса", "бык", "тигр", "кролик", "дракон", "змея", "лошадь", "коза", "обезьяна", "петух", "собака", "свинья"]
stihiya = ["дерево", "дерево", "огонь", "огонь", "почва", "почва", "металл", "металл", "вода", "вода"]
in_yan = ["ян", "инь"]

vis_yaer = [1920, 1924, 1928, 1932, 1936, 1940, 1944, 1948, 1952, 1956, 1960, 1964, 1968, 
            1972, 1976, 1980, 1984, 1988, 1992, 1996, 2000, 2004, 2008, 2012, 2016, 2020, 
            2024, 2028, 2032, 2036, 2040, 2044, 2048, 2052]

moon_palace = dict({1: [1920, 1942, 0, 1987, 2009, 2032], 2: [0, 1943, 1965, 1988, 2010, 0], 
    3: [1921, 1944, 1966, 0, 2011, 2033], 4: [1922, 0, 1967, 1989, 2012, 2034], 
    5: [1923, 1945, 1968, 1990, 0, 2035], 6: [1924, 1946, 0, 1991, 2013, 2036], 
    7: [0, 1947, 1969, 1992, 2014, 0], 8: [1925, 1948, 1970, 0, 2015, 2037], 
    9: [1926, 0, 1971, 1993, 2016, 2038], 10: [1927, 1949, 1972, 1994, 0, 2039], 
    11: [1928, 1950, 0, 1995, 2017, 2040], 12: [0, 1951, 1973, 1996, 2018, 0], 
    13: [1929, 1952, 1974, 0, 2019, 2041], 14: [1930, 0, 1975, 1997, 2020, 2042], 
    15: [1931, 1953, 1976, 1998, 0, 2043], 16: [1932, 1954, 0, 1999, 2021, 2044], 
    17: [0, 1955, 1977, 2000, 2022, 0], 18: [1933, 1956, 1978, 0, 2023, 2045], 
    19: [1934, 0, 1979, 2001, 2024, 2046], 20: [1935, 1957, 1980, 2002, 0, 2047], 
    21: [1936, 1958, 0, 2003, 2025, 2048], 22: [0, 1959, 1981, 2004, 2026, 0], 
    23: [1937, 1960, 1982, 0, 2027, 2049], 24: [1938, 0, 1983, 2005, 2028, 2050], 
    25: [1939, 1961, 1984, 2006, 0, 2051], 26: [1940, 1962, 0, 2007, 2029, 2052], 
    27: [0, 1963, 1985, 2008, 2030, 0], 28: [1941, 1964, 1986, 0, 2031, 2053]})

sec_step = {1:27, 2:2, 3:2, 4:5, 5:7, 6:10, 7:12, 8:15, 9:18, 10:20, 11:23, 12:25}


man = ["Liv.1", "Liv.4", "Liv.3", "Gb.37/Liv.3", "Liv.5/Gb.40", "Liv.2", "Liv.8", 
    "Kid.1", "Kid.7", "Kid.3", "Bl.58/Kid.3", "Kid.4/Bl.64", "Kid.2", "Kid.10", 
    "Lu.11", "Lu.8", "Lu.9", "Co.6/Lu.9", "Co.4/Lu.7", "Lu.10", "Lu.5", 
    "Ht.9/Hg.9", "Ht.4/Hg.5", "Ht.7/Hg.7", "Si.7/Ht.7/Hg.7", 
    "Ht.5/Hg.6/Si.4", "Ht.8/Hg.8", "Ht.3/ Hg.3"]

woman = ["Gb.41", "Gb.44", "Gb.34", "Gb.37/Liv.3", "Liv.5/Gb.40", "Gb.38", "Gb.43", 
    "Bl.65", "Bl.67", "Bl.40", "Bl.58/Kid.3", "Kid.4/Bl.64", "Bl.60", "Bl.66", 
    "Co.3", "Co.1", "Co.11", "Co.6/Lu.9", "Co4/Lu.7", "Co.5", "Co.2", 
    "Si.3", "Si.1", "Si.8", "Si.7/Ht.7/Hg.7", "Ht.5/Hg.6/Si.4", "Si.5", "Si.2"]


orange = '#ad5c0a'

color_dict = {'甲':'green', '乙':'green', '丙':'red', '丁':'red', '戊':f'{orange}', '己':f'{orange}', '庚':'grey', '辛':'grey', '壬':'blue', '癸':'blue',
                '子':'blue', '丑':f'{orange}', '寅':'green', '卯':'green', '辰':f'{orange}', '巳':'red', '午':'red', '未':f'{orange}', '申':'grey', '酉':'grey', '戌':f'{orange}', '亥':'blue'}


color_dict_earth = {'子':'blue', '丑':f'{orange}', '寅':'green', '卯':'green', '辰':f'{orange}', '巳':'red', '午':'red', '未':f'{orange}', '申':'grey', '酉':'grey', '戌':f'{orange}', '亥':'blue'}


dolgoletie = {
    'ду-май':'жень-май',
    'чун-май':'дай-май',
    'чонг-май':'дай-май',
    'инь-цзяо':'ян-цзяо',
    'инь-вэй':'ян-вэй',
    'жень-май':'ду-май',
    'жэнь-май':'ду-май',
    'дай-май':'чонг-май',
    'ян-цзяо':'инь-цзяо',
    'ян-вэй':'инь-вэй',
}

skydoc = {
    'ду-май':'ян-цзяо',
    'чун-май':'инь-вэй',
    'чонг-май':'инь-вэй',
    'инь-цзяо':'жень-май',
    'ян-вэй':'дай-май',
    'ян-цзяо':'ду-май',
    'инь-вэй':'чонг-май',
    'жень-май':'инь-цзяо',
    'жэнь-май':'инь-цзяо',
    'дай-май':'ян-вэй',
}

birthqi = {
    'ду-май':'инь-цзяо',
    'чун-май':'ян-вэй',
    'чонг-май':'ян-вэй',
    'жень-май':'ян-цзяо',
    'жэнь-май':'ян-цзяо',
    'инь-вэй':'дай-май',
    'инь-цзяо':'ду-май',
    'ян-вэй':'чонг-май',
    'ян-цзяо':'жень-май',
    'дай-май':'инь-вэй',
}